---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides
source: html/3a991d7a-a3fd-55d4-72a4-b5cf9ecabccb.htm
---
# DirectContext3DHandleOverrides Methods

Assigns values of the source overrides to this object.